# 进程
    # 程序
    # 只有在运行当中的程序 -- 进程
    # 操作系统和进程的关系
    # 为什么要引入进程的概念
        # 隔离资源
    # 进程是操作系统种资源分配的最小单位

    # 进程是怎么被调度的呢？
        # 1、先来先服务算法 FCFS -- first come firs service
        # 2、短作业优先算法
        # 3、时间片轮转算法
        # 4、多级反馈算法
            # 进程Process
            # 1 = [p1]
            # 2 = [p2]
    # 现代的操作系统种

    # 异步 只管调度 不等结果
    # 同步 调度之后，还一定要等待调度完成

    # 阻塞：
    # 非阻塞：
    # -- 影响进程的调度

# 进程的状态：就绪、运行和阻塞
# 进程的创建与结束
    # 创建进程有很多方式 -- 就是让一个程序运行起来
    # 所有的进程都是被进程创建出来的
    # 父进程   子进程